cf_billing/Catalogs/энргАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргАбоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агентский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домовладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальноеОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМуниципальноеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнутрРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГород</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПрописки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыАбонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНасПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРайонАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУлица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPабонент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЕИРЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАбонентыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАбонентыПомещений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргФилиалыАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФилиалыАбонентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргАбоненты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вызывается при переходе на версию конфигурации 2.1.3.16.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииАбоненты() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "АдресОбъекта";  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = "ТелефонАбонента";  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = "ТелефонСтационарныйАбонента";  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 3;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = "EmailАбонента"; 	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 4;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = "ПочтаДляКвитанцийАбонента"; 	
	ПараметрыВида.МожноИзменятьСпособРедактирования 		= Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений 			= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность 	= Истина;
	ПараметрыВида.Порядок = 5;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = "ПочтаДляУведомленийАбонента"; 	
	ПараметрыВида.МожноИзменятьСпособРедактирования 		= Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений 			= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность 	= Истина;
	ПараметрыВида.Порядок = 6;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "ПочтовыйАдресДляКвитанцийУведомленийАбонента";  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 7;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
КонецПроцедуры

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыПечати	-	ТаблицаЗначений	-	состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет структуру получателей печатных форм.
//
// Параметры:
//  СтруктураДанныхОбъектаПечати	-	Структура	-	энргФормированиеПечатныхформ.ДополнитьСоответствиеДанныхОбъектовПечати.
//
Процедура ЗаполнитьСтруктуруПолучателейПечатныхФорм(СтруктураДанныхОбъектаПечати) Экспорт

	СтруктураДанныхОбъектаПечати.ОсновнойПолучатель = "ФизЛицо";
	
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("ФизЛицо");
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса

// Получает значения реквизитов по ссылке.
//
// Параметры:
//  АбонентСсылка	-	СправочникСсылка.энргАбоненты.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция РезультатЗначенияРеквизитовПоСсылке(АбонентСсылка) Экспорт 
		
	Запрос  	= Новый Запрос(ТекстЗапросаЗначенияРеквизитовПоСсылке());
	Запрос.УстановитьПараметр("Абонент",АбонентСсылка);
	Возврат Запрос.Выполнить();
	
КонецФункции

// Получает значения реквизитов объекта.
//
// Параметры:
//  АбонентСсылка		-	СправочникСсылка.энргАбоненты.
//  ПолучаемыеСвойства	-	Структура.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияРеквизитовОбъекта(АбонентСсылка, ПолучаемыеСвойства) Экспорт	
	
	Результат 			= Новый Структура(ПолучаемыеСвойства);
	РезультатЗапроса  	= РезультатЗначенияРеквизитовПоСсылке(АбонентСсылка);
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка 		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
		АдресАбонента = Выборка.АдресОбъекта;
		КоличествоСимволовСтроки = СтрДлина(АдресАбонента);
		Фиктивное = СтрНайти(АдресАбонента, "фиктивное");
		Если Фиктивное > 0 Тогда 
			Разница = КоличествоСимволовСтроки - Фиктивное;
			АдресАбонента = Лев(АдресАбонента, СтрДлина(АдресАбонента) - Разница-3);
			Если Результат.Свойство("АдресОбъекта") Тогда
			Результат.АдресОбъекта = АдресАбонента;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает массив ссылок полнотекствого поиска.
//
// Параметры:
//  СтрокаПоиска	-	Строка.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргАбоненты.
//
Функция МассивСсылокПолноТекствогоПоиска(СтрокаПоиска) Экспорт 
	перем РезультатЗапроса;
		
	мСтрокиПоиска 		= СтрРазделить(СтрокаПоиска," ",Ложь);
	Схема 				= Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(ТекстЗапросаПолноТекстовыйПоискЗапросом());
	Пакет 				= Схема.ПакетЗапросов[0];
	Оператор 			= Пакет.Операторы[0];
	Отбор	 			= Оператор.Отбор;
	ОтборЭталон 		= Отбор[0];
	Для Индекс = 1 По мСтрокиПоиска.ВГраница() Цикл
		Отбор.Добавить(СтрЗаменить(ОтборЭталон,"&СтрокаПоиска1","&СтрокаПоиска" + (Индекс+1)));
	КонецЦикла;
	
	Запрос  			= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Для Индекс = 0 По мСтрокиПоиска.ВГраница() Цикл
		Запрос.УстановитьПараметр("СтрокаПоиска" + (Индекс+1), мСтрокиПоиска[Индекс]);
	КонецЦикла;
	
	РезультатЗапроса 	= Запрос.Выполнить();
			
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получает ссылку по ключевым параметрам.
//
// Параметры:
//  ДатаДокумента	-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ФизЛицо			-	СправочникСсылка.энргКонтрагенты.
//  Поставщик		-	СправочникСсылка.Организации.
//  Услуги			-	Массив из СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргАбоненты.
//
Функция СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги) Экспорт 
			
	Запрос  		= Новый Запрос;
	МВТ	= новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Дата",				Новый Граница(НачалоДня(ДатаДокумента),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Услуги",				Услуги);
	Запрос.УстановитьПараметр("ФизЛицо",			ФизЛицо);
	Запрос.УстановитьПараметр("КлючПомещения",		КлючПомещения);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Поставщик",			Поставщик);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	Услуги.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбоненты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_АбонентыЭтогоПомещения
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|ГДЕ
	|	энргАбоненты.ФизЛицо = &ФизЛицо
	|	И энргАбоненты.КлючПомещения = &КлючПомещения
	|	И энргАбоненты.Район = &Район
	|	И энргАбоненты.Организация = &Организация
	|	И энргАбоненты.Поставщик = &Поставщик
	|	И НЕ энргАбоненты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_АктивныеАбонентыЭтогоПомещения
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&Дата,
	|			Абонент В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_АбонентыЭтогоПомещения КАК ВТ)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_АбонентыЭтогоПомещенияДляУказанныхУслуг
	|ИЗ
	|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
	|			&Дата,
	|			Услуга В
	|					(ВЫБРАТЬ
	|						ВТ.Услуга
	|					ИЗ
	|						ВТ_Услуги КАК ВТ)
	|				И КлючПомещения = &КлючПомещения) КАК энргАбонентыПомещенийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргАбонентыПомещенийСрезПоследних.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктивныеАбонентыЭтогоПомещения.Абонент КАК Абонент
	|ИЗ
	|	ВТ_АктивныеАбонентыЭтогоПомещения КАК ВТ_АктивныеАбонентыЭтогоПомещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АбонентыЭтогоПомещенияДляУказанныхУслуг КАК ВТ_АбонентыЭтогоПомещенияДляУказанныхУслуг
	|		ПО ВТ_АктивныеАбонентыЭтогоПомещения.Абонент = ВТ_АбонентыЭтогоПомещенияДляУказанныхУслуг.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АктивныеАбонентыЭтогоПомещения.Абонент";
	
	Если ФизЛицо = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргАбоненты.ФизЛицо = &ФизЛицо", "ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса			= Запрос.Выполнить();
	Выборка 					= РезультатЗапроса.Выбрать(); 
	Если Выборка.Следующий() тогда
		Возврат Выборка.Абонент; 
	КонецЕсли;
	
	Возврат Справочники.энргАбоненты.ПустаяСсылка();
	
КонецФункции

// Заполняет объект по описанию.
//
// Параметры:
//  АбонентСсылка	-	СправочникСсылка.энргАбоненты.
//  ОписаниеОбъекта	-	Структура.
//  ЛицевойСчет		-	Строка.
//  ЭтоНоваяСсылка	-	Булево.
//
Процедура ЗаполнитьОбъектПоОписанию(АбонентСсылка, ОписаниеОбъекта, ЛицевойСчет, ЭтоНоваяСсылка) Экспорт 
	
	Если ЭтоНоваяСсылка Тогда
		АбонентОбъект 									= СоздатьЭлемент();
		АбонентОбъект.УстановитьСсылкуНового(АбонентСсылка);
	Иначе
		АбонентОбъект 									= АбонентСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЕстьИзменения 										= Ложь;
	Если НЕ АбонентОбъект.Организация = ОписаниеОбъекта.Организация Тогда 
		АбонентОбъект.Организация 						= ОписаниеОбъекта.Организация;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ АбонентОбъект.Район = ОписаниеОбъекта.Район Тогда 
		АбонентОбъект.Район 							= ОписаниеОбъекта.Район;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ АбонентОбъект.Родитель = ОписаниеОбъекта.ГруппаАбонента Тогда
		АбонентОбъект.Родитель 							= ОписаниеОбъекта.ГруппаАбонента;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ АбонентОбъект.КлючПомещения = ОписаниеОбъекта.КлючПомещения Тогда
		АбонентОбъект.КлючПомещения 					= ОписаниеОбъекта.КлючПомещения;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ АбонентОбъект.ФизЛицо = ОписаниеОбъекта.ФизЛицо Тогда
		АбонентОбъект.ФизЛицо 							= ОписаниеОбъекта.ФизЛицо;
		АбонентОбъект.Наименование 						= СокрЛП(ОписаниеОбъекта.ФизЛицо);
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ АбонентОбъект.ВидОбъекта = ОписаниеОбъекта.ВидОбъекта Тогда
		АбонентОбъект.ВидОбъекта 						= ОписаниеОбъекта.ВидОбъекта;
		ЕстьИзменения									= Истина;
	КонецЕсли;
		
	Если ЭтоНоваяСсылка Тогда  
		АбонентОбъект.ЛицевойСчет 						= ЛицевойСчет;
	КонецЕсли;
	
	Если ОписаниеОбъекта.Свойство("МуниципальноеОбразование") Тогда
		Если НЕ АбонентОбъект.МуниципальноеОбразование = ОписаниеОбъекта.МуниципальноеОбразование Тогда
			АбонентОбъект.МуниципальноеОбразование 		= ОписаниеОбъекта.МуниципальноеОбразование;
			ЕстьИзменения								= Истина;
		КонецЕсли;		
	КонецЕсли;
		
	Если ОписаниеОбъекта.Свойство("СтарыйЛС") Тогда
		Если НЕ СокрЛП(АбонентОбъект.СтарыйЛС) = СокрЛП(ОписаниеОбъекта.СтарыйЛС) Тогда
			АбонентОбъект.СтарыйЛС 						= СокрЛП(ОписаниеОбъекта.СтарыйЛС);
			ЕстьИзменения								= Истина;	
		КонецЕсли;		
	КонецЕсли;
	
	Если ОписаниеОбъекта.Свойство("СлужебныеОтметки") Тогда 
		Если НЕ АбонентОбъект.СлужебныеОтметки = ОписаниеОбъекта.СлужебныеОтметки Тогда 
			АбонентОбъект.СлужебныеОтметки 				= ОписаниеОбъекта.СлужебныеОтметки;
			ЕстьИзменения								= Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ОписаниеОбъекта.Свойство("Поставщик") Тогда 
		Если НЕ АбонентОбъект.Поставщик = ОписаниеОбъекта.Поставщик Тогда 
			АбонентОбъект.Поставщик 					= ОписаниеОбъекта.Поставщик;
			ЕстьИзменения								= Истина;
		КонецЕсли;
	КонецЕсли;
	
	//АбонентОбъект.ВидОбъекта 					= ?(ЭтоСменаСобственника, ТекущийОбъект.Абонент.ВидОбъекта, ДанныеАбонента.ВидОбъекта);
	
	//Если ФормироватьЛС тогда
	//	АбонентОбъект.ЛицевойСчет 				= СФормироватьЛицевойСчет(ТекущийОбъект.ГруппаАбонента, ТекущийОбъект.Район, ТекущийОбъект.Организация);
	//ИначеЕсли ДанныеАбонента.Свойство("ЛицевойСчет") Тогда 
	//	АбонентОбъект.ЛицевойСчет 				= ДанныеАбонента.ЛицевойСчет;
	//КонецЕсли;
		
	//СтрокаКИ = Неопределено;
	////Помещение =  ДанныеАбонента.КлючПомещения.Помещение;
	//Помещение =  АбонентОбъект.КлючПомещения.Помещение;
	//Если ЗначениеЗаполнено(Помещение) И Не Помещение.Фиктивное Тогда
	//	СтрокаКИ = Помещение.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресПомещения, "Вид");	
	//Иначе
	//	Строение =  ДанныеАбонента.КлючПомещения.Строение;
	//	Если ЗначениеЗаполнено(Строение) Тогда
	//		СтрокаКИ = Строение.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресДома, "Вид");
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если СтрокаКИ <> Неопределено Тогда
	//	ТипКИ		= Перечисления.ТипыКонтактнойИнформации.Адрес;
	//	ВидКИ 		= Справочники.ВидыКонтактнойИнформации.АдресОбъекта;
	//	АбонентОбъект.КонтактнаяИнформация.Очистить();
	//	
	//	Если НЕ ПустаяСтрока(СтрокаКИ.Значение) Тогда
	//		АдресДома 	= СтрокаКИ.Значение;
	//		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(АбонентОбъект, АдресДома, ВидКИ, ТипКИ);
	//	Иначе 
	//		АдресДома 	= СтрокаКИ.Представление;
	//		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(АбонентОбъект, УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(АдресДома, ВидКИ), ВидКИ, ТипКИ);
	//	КонецЕсли;		
	//КонецЕсли;
	
	Если Не ЕстьИзменения Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		АбонентОбъект.Записать();		
	Исключение
		
	КонецПопытки; 	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" и не Параметры.свойство("Ключ") тогда
		
		СтандартнаяОбработка 	= ложь;
		
		ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
		
		Если ЕстьЗначенияЗаполнения тогда
			ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС");
			Параметры.ЗначенияЗаполнения.Вставить("ВидОперации",ВидОперации);
		КонецЕсли;
		
		ВыбраннаяФорма 			= "Документ.энргОперацияСЛицевымСчетом.Форма.ФормаДокументаОткрытиеЛС";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаЗначенияРеквизитовПоСсылке()
	Текст 		=
	"ВЫБРАТЬ
	|	Абоненты.Ссылка КАК Абонент,
	|	Абоненты.КлючПомещения КАК КлючПомещения,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	Абоненты.Район КАК Район,
	|	Абоненты.ЛицевойСчет КАК ЛицевойСчет,
	|	Абоненты.Организация КАК Организация,
	|	Абоненты.Родитель КАК ГруппаАбонента,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	Абоненты.ФизЛицо КАК Контрагент,
	|	Абоненты.ВидОбъекта КАК ВидОбъекта,
	|	Абоненты.МуниципальноеОбразование КАК МуниципальноеОбразование,
	|	энргФилиалыАбонентовСрезПоследних.Филиал КАК АбонентскийОтдел
	|ПОМЕСТИТЬ НачальныеДанные
	|ИЗ
	|	Справочник.энргАбоненты КАК Абоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО Абоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних(, Абонент = &Абонент) КАК энргФилиалыАбонентовСрезПоследних
	|		ПО (энргФилиалыАбонентовСрезПоследних.Абонент = Абоненты.Ссылка)
	|ГДЕ
	|	Абоненты.Ссылка = &Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКлючиПомещений.Строение,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	Абоненты.МуниципальноеОбразование,
	|	Абоненты.Район,
	|	Абоненты.ФизЛицо,
	|	Абоненты.Организация,
	|	Абоненты.ВидОбъекта,
	|	энргКлючиПомещений.Помещение,
	|	энргКлючиПомещений.ЧастныйСектор,
	|	Абоненты.Родитель,
	|	Абоненты.ЛицевойСчет,
	|	Абоненты.КлючПомещения,
	|	энргФилиалыАбонентовСрезПоследних.Филиал,
	|	Абоненты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачальныеДанные.Абонент КАК Абонент,
	|	НачальныеДанные.КлючПомещения КАК КлючПомещения,
	|	НачальныеДанные.Строение КАК Строение,
	|	НачальныеДанные.Помещение КАК Помещение,
	|	НачальныеДанные.Район КАК Район,
	|	НачальныеДанные.ЛицевойСчет КАК ЛицевойСчет,
	|	НачальныеДанные.Организация КАК Организация,
	|	НачальныеДанные.ГруппаАбонента КАК ГруппаАбонента,
	|	НачальныеДанные.ЧастныйСектор КАК ЧастныйСектор,
	|	НачальныеДанные.МКД КАК МКД,
	|	НачальныеДанные.Контрагент КАК Контрагент,
	|	НачальныеДанные.ВидОбъекта КАК ВидОбъекта,
	|	НачальныеДанные.МуниципальноеОбразование КАК МуниципальноеОбразование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НачальныеДанные.Помещение.Фиктивное
	|				ТОГДА энргСтроенияКонтактнаяИнформация.Представление
	|			ИНАЧЕ ЕСТЬNULL(энргПомещенияКонтактнаяИнформация.Представление, энргСтроенияКонтактнаяИнформация.Представление)
	|		КОНЕЦ) КАК АдресОбъекта,
	|	МАКСИМУМ(ЕСТЬNULL(энргПомещенияКонтактнаяИнформация.Представление, энргСтроенияКонтактнаяИнформация.Представление)) КАК АдресОбъектаБезУсловий,
	|	НачальныеДанные.АбонентскийОтдел КАК АбонентскийОтдел
	|ИЗ
	|	НачальныеДанные КАК НачальныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|		ПО НачальныеДанные.Строение = энргСтроенияКонтактнаяИнформация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|		ПО НачальныеДанные.Помещение = энргПомещенияКонтактнаяИнформация.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НачальныеДанные.МКД,
	|	НачальныеДанные.ЧастныйСектор,
	|	НачальныеДанные.ГруппаАбонента,
	|	НачальныеДанные.Помещение,
	|	НачальныеДанные.КлючПомещения,
	|	НачальныеДанные.ВидОбъекта,
	|	НачальныеДанные.Контрагент,
	|	НачальныеДанные.Район,
	|	НачальныеДанные.ЛицевойСчет,
	|	НачальныеДанные.Организация,
	|	НачальныеДанные.МуниципальноеОбразование,
	|	НачальныеДанные.Строение,
	|	НачальныеДанные.АбонентскийОтдел,
	|	НачальныеДанные.Абонент";
		
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолноТекстовыйПоискЗапросом()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Наименование КАК Наименование,
	|	ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ЕСТЬNULL(энргСтроения.Наименование, """") КАК Строение,
	|	ЕСТЬNULL(энргПомещения.Наименование, """") КАК Помещение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Абоненты.Ссылка КАК Ссылка,
	|		Абоненты.Наименование КАК Наименование,
	|		Абоненты.ЛицевойСчет КАК ЛицевойСчет,
	|		ЕСТЬNULL(Организации.Наименование, """") КАК Организация,
	|		КлючиПомещений.Строение КАК Строение,
	|		КлючиПомещений.Помещение КАК Помещение
	|	ИЗ
	|		Справочник.энргАбоненты КАК Абоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО Абоненты.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК КлючиПомещений
	|			ПО Абоненты.КлючПомещения = КлючиПомещений.КлючПомещения
	|	ГДЕ
	|		НЕ Абоненты.ПометкаУдаления
	|		И НЕ Абоненты.ЭтоГруппа) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО ВложенныйЗапрос.Строение = энргСтроения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ВложенныйЗапрос.Помещение = энргПомещения.Ссылка
	|ГДЕ
	|	(ВложенныйЗапрос.Наименование ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%""
	|			ИЛИ ВложенныйЗапрос.ЛицевойСчет ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%""
	|			ИЛИ ЕСТЬNULL(энргСтроения.Наименование, """") ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%""
	|			ИЛИ ЕСТЬNULL(энргПомещения.Наименование, """") ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%"")";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
